name: "pipeline_0"
backend: "python"
max_batch_size: 8

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
    
  }
]

output [
  {
    name: "generated_image"
    data_type: TYPE_UINT8	
    dims: [ -1, -1, -1]
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]
parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/home/condpackenv/stablediff_env.tar.gz"}
}
